Tekla.Structures.Model.Internal.FarmiHelper
Helping farming.

Tekla.Structures.Model.Internal.FarmiHelper.CopyAndConvertModel(System.String,System.String)
Copies the model, opens and saves the copy to convert it.
sourcePath: The source path.
targetPath: The target path.

Tekla.Structures.Model.Internal.FarmiHelper.CopyDirectory(System.String,System.String,System.Boolean,System.Boolean,System.String)
Copy directory recursively.
path: Directory path.
targetPath: Target directory path.
throwExceptions: If true exceptions are thrown and operation discontinued at exception.
If false exceptions are not thrown and operation continues after exception.
clearReadOnlyFlag: if set to true [remove read only flag of files].
excludeRegex: The exclude regex.